#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.ami: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-0dc99ad8b282c0867]
data.aws_ami.ami: Read complete after 1s [id=ami-0c4e4b4eb2e11d1d4]
aws_internet_gateway.gw: Refreshing state... [id=igw-04a4f8550bc0d06ce]
aws_subnet.subnet: Refreshing state... [id=subnet-0ed1fcdd5d8d07f9f]
aws_security_group.main: Refreshing state... [id=sg-0c8b9eae32eed74e2]
aws_security_group_rule.public_out: Refreshing state... [id=sgrule-3116025651]
aws_instance.instance: Refreshing state... [id=i-02f266aa60b7b2428]
aws_security_group_rule.public_in_ssh: Refreshing state... [id=sgrule-3912742499]
aws_route.internet_in: Refreshing state... [id=r-rtb-0293ff1437ee6ffb61080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.iam_user will be created
  + resource "aws_iam_user" "iam_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "user14"
      + path          = "/"
      + tags          = {
          + "tag-key" = "user14"
        }
      + tags_all      = {
          + "tag-key" = "user14"
        }
      + unique_id     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ashishjullia, Action: `pull_request`*